Tekla Open API Reference for Tekla Structures 2025
PourType Methods
The PourObjectFilterExpressions.PourType type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
PourObjectFilterExpressions.PourType Class
Tekla.Structures.Filtering.Categories Namespace